ОперативныеЗадачиЗанятие3/src/Documents/ПланированиеОказанияУслуг/ПланированиеОказанияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланированиеОказанияУслуг</name>
  <registerRecords>InformationRegister.ПланированиеОказаниеУслуг</registerRecords>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РеализацияТоваровИУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СервисМенеджер</name>
      <type>
        <types>CatalogRef.СервисМенеджеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиЗанятие3/src/InformationRegisters/ПланированиеОказаниеУслуг/ПланированиеОказаниеУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланированиеОказаниеУслуг</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПланируемаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РеальнаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СервисМенеджер</name>
    <type>
      <types>CatalogRef.СервисМенеджеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровИУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОперативныеЗадачиЗанятие3/src/Documents/ПланированиеОказанияУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПланированиеОказаниеУслуг.Записывать = Истина;
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		
		Движение = Движения.ПланированиеОказаниеУслуг.Добавить();
		
		Движение.Период = Дата;
		Движение.СервисМенеджер = ТекСтрокаСостав.СервисМенеджер;
		Движение.Услуга = ТекСтрокаСостав.Услуга;
		Движение.Контрагент = ТекСтрокаСостав.Контрагент;
		Движение.ДокументОснование = ТекСтрокаСостав.ДокументОснование;
		Движение.ПланируемаяДатаВыполнения = ТекСтрокаСостав.ПланируемаяДатаВыполнения;
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
